tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
tap "weaveworks/tap"
brew "awscli"
brew "docker"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "icu4c"
brew "harfbuzz"
brew "little-cms2"
brew "gradle"
brew "kubernetes-cli"
brew "maven"
brew "minikube"
brew "mysql", restart_service: true
brew "neovim"
brew "node@18", link: true
brew "openjdk@17"
brew "postgresql@14"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "tmux"
brew "zsh-autocomplete"
brew "weaveworks/tap/eksctl"
cask "displaylink"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "google-chrome"
cask "intellij-idea"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "numi"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
