brew "awscli"
brew "python@3.12"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "gradle"
brew "imagemagick"
brew "kubernetes-cli"
brew "maven"
brew "minikube"
brew "mysql"
brew "neovim"
brew "node@18", link: true
brew "openjdk@17"
brew "postgresql@14"
brew "redis"
brew "ripgrep"
brew "rust"
brew "tmux"
brew "zsh-autosuggestions"
brew "weaveworks/tap/eksctl"
cask "bitwarden"
cask "displaylink"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "kitty"
cask "numi"
cask "spotify"
cask "zoom"
