brew "clang-format"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "openjdk"
brew "google-java-format"
brew "gradle"
brew "imagemagick"
brew "node"
brew "js-beautify"
brew "maven"
brew "mysql", restart_service: true
brew "neovim"
brew "postgresql@14"
brew "redis", restart_service: true
brew "ripgrep"
brew "stylua"
brew "tmux"
brew "zsh-autosuggestions"
cask "bitwarden"
cask "displaylink"
cask "docker"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "google-chrome"
cask "intellij-idea-ce"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "minecraft"
cask "postman"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
