brew "node"
brew "bitwarden-cli"
brew "python@3.13"
brew "python@3.12"
brew "gcc"
brew "git"
brew "go"
brew "gradle"
brew "imagemagick"
brew "maven"
brew "mysql", restart_service: :changed
brew "openjdk@17"
brew "postgresql@14"
brew "redis", restart_service: :changed
brew "tmux"
brew "zsh-autosuggestions"
brew "mongodb/brew/mongodb-community"
cask "bitwarden"
cask "displaylink"
cask "docker"
cask "dotnet-sdk"
cask "git-credential-manager"
cask "google-chrome"
cask "intellij-idea-ce"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "mongodb-compass"
cask "mono-mdk-for-visual-studio"
cask "mysqlworkbench"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "sohibe.java-generate-setters-getters"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zxh404.vscode-proto3"
