tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
tap "weaveworks/tap"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "python@3.12"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "icu4c"
brew "harfbuzz"
brew "gradle"
brew "libheif"
brew "imagemagick"
brew "maven"
brew "mysql", restart_service: true
brew "neovim"
brew "node"
brew "openjdk@17"
brew "postgresql@14"
brew "redis", restart_service: true
brew "ripgrep"
brew "tmux"
brew "zsh-autosuggestions"
cask "bitwarden"
cask "displaylink"
cask "docker"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "google-chrome"
cask "intellij-idea-ce"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "minecraft"
cask "postman"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
